SampleApp/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "abcd"], ["email", "abcd@email.com"], ["password_digest", "$2a$10$wgTpfs4UNLwwVjgnERgWs.odtGyLEA9vXLJS3lTEVIKiVEh2h5kKC"], ["updated_at", "2015-11-09 15:28:55.256390"], ["id", 1]]